const text = `4 
ПОДАРУНКИ ДО СВЯТ
ТОП дитячих побажань із листів Святому Миколаю.
20 
ІГРАШКИ МОНКАРТ — ВИДОВИЩНА ТРАНСФОРМАЦІЯ
Серія трансформерів Young Toys за мотивами мультфільму «Монстри Монкарт».
26 
СПРАВЖНЄ АВТОРАЛІ
Машинки New Bright на радіокеруванні розвивають швидкість до 15 км/год.
30 
ДЗИҐИ З ДИСТАНЦІЙНИМ КЕРУВАННЯМ
Блейди Infinity NADO серії Electronic.
36 
ЗИМОВІ КОНВЕРТИ ДЛЯ ВІЗОЧКІВ І АВТОКРІСЕЛ
Піклуємося про найтепліші моменти з Nuvita.
42 
MYMIA – ДБАЄ ПРО ПОТРЕБИ МАТУСЬ
Одна сумка для безлiчi можливостей.
46 
ВІДЧУТИ СЕБЕ СПРАВЖНІМ ФОКУСНИКОМ
Магічні іграшки Fun Promotion. 50 IQ ELECTRIC CUBE Захоплива головоломка із світлодіодним підсвічуванням.
52 
ДЛЯ МАЛЕНЬКИХ ВИНАХІДНИКІВ
Дитячі набори металевих конструкторів Same Toy.
56 
ІГРАШКИ-РОБОТИ ВРАЖАЮТЬ УЯВУ
Роботи Same Toy навчають англійської мови й основ програмування.
60 
У СВІТІ «МАЙНКРАФТ» Є НОВИНИ
Грай у реальному житті разом із фігурками Jazwares Minecraft.
66 
ПЛАТФОРМА СУЧАСНИХ ПІДЛІТКІВ
Збирай колекцію ігрових фігурок Jazwares Roblox.
74 
НАСНАГА ГРАТИ, ХИСТ ЗАРОБЛЯТИ
Чому вже час долучитися до Fortnite.
86 
ДОТОРКНИСЬ ДО ЛЕГЕНДИ
Римейк першої консолі PlayStation Classic.
88 
PLAYSTATION ДЛЯ ДІТЛАХІВ
Добірка кращих ігор для дітей.
92 
НОВА ЕРА СИМРЕЙСИНГУ
Кокпіти Playseat та маніпулятори Thrustmaster.
104 
ІНСТРУМЕНТ, З ЯКИМ БАТЬКИ МОЖУТЬ УСЕ
Dremel подарує іграшкам нове життя.
106 
НОВОРІЧНА КАЗКА ВЛАСНИМИ РУКАМИ
Інструменти Topex Creator.
108 
ПОВНЕ ЗАНУРЕННЯ У МУЗИЧНИЙ ВИР З УЛЮБЛЕНИМИ ГЕРОЯМИ
Навушники й акустичні системи eKids`;

const lines = text.split('\n');

const contents = [];

console.log(contents)
for (let i = 0; i < lines.length; i += 3) {
    contents.push({
        number: lines[i].trim(),
        name: lines[i + 1].trim(),
        text: lines[i + 2].trim()
    });
}
export default contents;
