const text = `4
СПІЛКУВАТИСЬ УКРАЇНСЬКОЮ МОДНО ТА СУЧАСНО
Мовленнєві помилки в щоденній бізнес-діяльності. Частина 12.
8
РОЛЬ СУЧАСНОГО IT-КОНСАЛТИНГУ У ВПРОВАДЖЕННІ НОВИХ ТЕХНОЛОГІЙ
Кейс O-Digital: спроєктовано цільову архітектуру та впроваджено рішення на базі Microsoft Fabric із використанням хмарного середовища AWS.
14
ІНТЕЛЕКТУАЛЬНИЙ АСИСТЕНТ ДЛЯ ВДОСКОНАЛЕННЯ РОБОЧИХ ПРОЦЕСІВ
Багатофункціональне рішення Copilot підтримує широкий спектр сценаріїв роботи з інформацією.
18
ЗБЕРІГАННЯ ДАНИХ ЯК СТРАТЕГІЧНА ОСНОВА БІЗНЕСУ
Lenovo DS Series: оптимізоване блочне зберігання з розширеними функціями захисту, можливістю масштабування та ефективним використанням системних ресурсів.
20
АРХІТЕКТУРА БЕЗПЕКИ ЕПОХИ МУЛЬТИХМАРИ ТА ШТУЧНОГО ІНТЕЛЕКТУ
Cisco Hybrid Mesh Firewall поєднує мережевий периметр, хмару, користувачів і внутрішні робочі навантаження.
26
ВИХІД ЗА МЕЖІ ТРАДИЦІЙНИХ МОДЕЛЕЙ НАЗЕМНИХ ІНФРАСТРУКТУР
Dell Private Cloud – це платформа нового покоління, що забезпечує гнучке керування ІТ-ресурсами та формує надійну основу для стабільного розвитку бізнесу.
28
ЗАХИЩЕНІ ПЛАНШЕТИ ДЛЯ ЕКСТРЕМАЛЬНИХ УМОВ
Dell Pro Rugged на базі Windows розроблено з акцентом на максимальну витривалість і безперебійність роботи.
32
НОУТБУКИ ДЛЯ ТОПМЕНЕДЖЕРІВ З АІ
HP оновлено, розширено та перейменовано модельний ряд ноутбуків EliteBook, орієнтованих насамперед на корпоративних користувачів середньої та вищої управлінської ланки.
40
ЗБИРАЄМО НОВОЧАСНИЙ ПК ІЗ ВИСОКОТЕХНОЛОГІЧНИМИ КОМПОНЕНТАМИ
У рішеннях Zalman інженерну логіку поєднано з продуманою конструкцією та вимогами до візуальної естетики сучасних ПК-систем.
48
БЛОКИ ЖИВЛЕННЯ ДЛЯ БУДЬ-ЯКОЇ КОНФІГУРАЦІЇ
Асортимент 2E охоплює як нові продукти, так і модернізовані версії популярних моделей.
52
БАГАТОФУНКЦІОНАЛЬНИЙ ПРИСТРІЙ ДЛЯ КОРПОРАТИВНОГО ДРУКУ
Lexmark CX950se поєднує друк, копіювання і сканування з опціями підключення та оброблення документів.
56
ОФІС БЕЗ ЗАЙВОЇ РУТИНИ
Xerox VersaLink – лінійка пристроїв, у якій акцент зроблено не лише на швидкості друку, а передусім на програмній логіці та безшовній цифровій взаємодії.
62
МОДУЛЬНА АУДІОАРХІТЕКТУРА ДЛЯ ПЕРЕГОВОРНИХ ПРОСТОРІВ
HP Poly Studio A2 – це платформа, яка поєднує масштабованість, просту інсталяцію та стабільно якісне передавання мовлення.
66
ПОРТАТИВНА АКУСТИКА ДЛЯ БІЗНЕСУ ТА РОЗВАГ
Оновлені автономні колонки Sony формують комплексну екосистему.
72
ГЛОБАЛЬНІ ІННОВАЦІЇ ДЛЯ ЕНЕРГОНЕЗАЛЕЖНОСТІ УКРАЇНИ
Інвертори Solis відкривають можливості для реалізації надійних і масштабованих енергетичних рішень.
76
АКУМУЛЯТОР ДЛЯ РЕЗЕРВНОГО ЖИВЛЕННЯ ТА СОНЯЧНИХ ЕЛЕКТРОСТАНЦІЙ
Leapton EL-A05 IP65 – пристрій нового покоління, який забезпечує стабільний енергетичний резерв і безперебійну роботу систем живлення навіть за складних умов експлуатації.`;

const lines = text.split('\n');

const contents = [];

console.log(contents)
for (let i = 0; i < lines.length; i += 3) {
    contents.push({
        number: lines[i].trim(),
        name: lines[i + 1].trim(),
        text: lines[i + 2].trim()
    });
}
export default contents;
