const text = `6
Електрочайники 
10
Кавоварки 
12
Соковичавниці 
14
Блендери занурювані 
15
Блендери стаціонарні 
15
Чопери 
16
Міксери 
17
Кухонні ваги 
18
Кухонні комбайни 
18
М’ясорубки 
20
Кавомолки 
20
Скиборізка 
22
Тостери 
22
Сендвічниці 
23
Мультимейкери 
23
Електрогрилі 
24
Плитки електричні 
25
Плитки індукційні 
26
Сушарки
26 
Мультиварки 
27
Мікрохвильові печі 
30
Печі електричні 
32
Плити 
38
Роботи-пилососи 
38
Бездротові пилососи
41
Машинки для очищення одягу 
41
Праски 
42
Відпарювачі 
45
Ваги підлогові 
47
Іригатори портативні та стаціонарні
47
Електричні зубні щітки 
50
Фени 
52
Професійні фени 
52
Плойки 
53
Випрямлячі волосся 
53
Машинки для підстригання
54
Тримери 
54
Епілятори
56
Холодильники 
59
Морозильні скрині 
60
Морозильні камери 
61
Холодильники для вина 
61
Льодогенератори 
63
Пральні машини напівавтоматичні
64
Пральні машини автоматичні 
68
Конвекційні обігрівачі 
69
Тепловентилятори 
69
Теплові гармати 
70
Масляні обігрівачі 
71
Інфрачервоні обігрівачі 
72
Керамічні нагрівальні панелі 
75
Вентилятори 
77
Зволожувачі повітря 
77
Очищувачі повітря 
78
Електричні водонагрівачі 
80
Вбудовані холодильники для вина`;

const lines = text.split('\n');

const contents = [];

for (let i = 0; i < lines.length; i += 2) {
    contents.push({
        number: lines[i].trim(),
        name: lines[i + 1].trim(),
    });
}
export default contents;
console.log(contents)



